#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("МассивСубконтоПДР", МассивСубконтоПДР);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПрочиеДоходыРасходы_НеОблагаетсяНДС" Тогда
		Если Модифицированность Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПоУмолчаниюНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(МассивСубконтоПДР);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	ЗаполнитьПоУмолчаниюНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	МассивСубконто = Справочники.ПрочиеДоходыИРасходы.МассивСубконтоНеОблагаетсяНДС();
	Если МассивСубконто.Количество() = 0 Тогда
		МассивСубконто = Справочники.ПрочиеДоходыИРасходы.МассивСубконтоРазрешенныхПрочихДоходовИРасходов();
	КонецЕсли;
	
	МассивСубконтоПДР.ЗагрузитьЗначения(МассивСубконто);

КонецПроцедуры

#КонецОбласти